use students1;
set FOREIGN_KEY_CHECKS = 0;
TRUNCATE TABLE cathedra;
set FOREIGN_KEY_CHECKS = 1;

INSERT INTO cathedra(full) VALUES ('Высшей математики'),('Вычислительных методов и программирования'),('Гуманитарных дисциплин'),('Защиты информации'),('Инженерной и компьютерной графики'),('Инженерной психологии и эргономики'),('ностранных языков N1'),('Иностранных языков N2'),('Интеллектуальных информационных технологий'),('Инфокоммуникационных технологий'),('Информатики'),('Информационных радиотехнологий'),('Информационных технологий автоматизированных систем'),('Менеджмента'),('Микро- и наноэлектроники'),('Общеобразовательных дисциплин'),('Программного обеспечения информационных технологий'),('Проектирования информационно-компьютерных систем'),('Систем управления'),('Теоретических основ электротехники'),('Физвоспитания'),('Физики'),('Философии'),('кономики'),('Экономической информатики'),('Электроники'),('Электронной техники и технологии'),('Электронных вычислительных машин'),('Электронных вычислительных средств'),('Радиоэлектронной техники ВВС и войск ПВО'),('Связи'),('Тактической и общевоенной подготовки');

