use students1;
set FOREIGN_KEY_CHECKS=0;
TRUNCATE TABLE districts;
TRUNCATE TABLE type_city;
TRUNCATE TABLE grade_type;
TRUNCATE TABLE issuing_authority;
TRUNCATE TABLE matter;
TRUNCATE TABLE name4;
TRUNCATE TABLE name5;
TRUNCATE TABLE pay_type;
TRUNCATE TABLE sex;
TRUNCATE TABLE status;
TRUNCATE TABLE speciality;
truncate table teacher;
INSERT INTO districts(district) VALUES ('Барановичский'),('Белыничский'),('Березинский'),('Берёзовский'),('Берестовицкий'),('Бешенковичский'),('Бобруйский'),('Борисовский'),('Брагинский'),('Браславский'),('Брестский'),('Буда-Кошелевский'),('Быховский'),('Верхнедвинский'),('Ветковский'),('Вилейский'),('Витебский'),('Волковысский'),('Воложинский'),('Вороновский'),('Ганцевичский'),('Глубокский'),('Глусский'),('Гомельский'),('Горецкий'),('Городокский'),('Гродненский'),('Дзержинский'),('Добрушский'),('Докшицкий'),('Дрибинский'),('Дрогичинский'),('Дубровенский'),('Дятловский'),('Ельский'),('Жабинковский'),('Житковичский'),('Жлобинский'),('Зельвенский'),('Ивановский'),('Ивацевичский'),('Ивьевский'),('Калинковичский'),('Каменецкий'),('Кировский'),('Клецкий'),('Климовичский'),('Кличевский'),('Кобринский'),('Копыльский'),('Кореличский'),('Кормянский'),('Костюковичский'),('Краснопольский'),('Кричевский'),('Круглянский'),('Крупский'),('Лельчицкий'),('Лепельский'),('Лидский'),('Лиозненский'),('Логойский'),('Лоевский'),('Лунинецкий'),('Любанский'),('Ляховичский'),('Малоритский'),('Минский'),('Миорский'),('Могилевский'),('Мозырский'),('Молодечненский'),('Мостовский'),('Мстиславский'),('Мядельский'),('Наровлянский'),('Несвижский'),('Новогрудский'),('Октябрьский'),('Оршанский'),('Осиповичский'),('Островецкий'),('Ошмянский'),('Петриковский'),('Пинский'),('Полоцкий'),('Поставский'),('Пружанский'),('Пуховичский'),('Речицкий'),('Рогачевский'),('Россонский'),('Светлогорский'),('Свислочский'),('Сенненский'),('Славгородский'),('Слонимский'),('Слуцкий'),('Смолевичский'),('Сморгонский'),('Солигорский'),('Стародорожский'),('Столбцовский'),('Столинский'),('Толочинский'),('Узденский'),('Ушачский'),('Хойникский'),('Хотимский'),('Чаусский'),('Чашникский'),('Червенский'),('Чериковский'),('Чечерский'),('Шарковщинский'),('Шкловский'),('Шумилинский'),('Щучински');
INSERT INTO type_city(full) values('агрогородок'), ('аул'), ('город'), ('дачный поселок'), ('деревня'),  ('местечко'), ('поселок'), ('поселок городского типа'), ('пригород'), ('село'), ('станица'), ('хутор');
insert into grade_type(type) values ('1'),('2'),('3'),('4'),('5'),('6'),('7'),('8'),('9'),('10'),('зачёт'),('незачёт'),('неявка');
INSERT into issuing_authority(name) SELECT concat(district,  ' РОВД') from districts;
INSERT into matter(full) VALUES ('Алгоритмы'), ('Методы численного анализа'), ('Линейная алгебра'), ('Иностранный язык'), ('Физкультура'), ('Математический анализ'), ('Программирование'), ('Философия'), ('Теория вероятности'), ('Математичекая статистика'), ('Математика'), ('Базы данных'),('Бизнес'),('Экономика');
INSERT INTO name4(name) select name from name1;
INSERT INTO name5(name) select name from name2;
INSERT INTO pay_type(full) VALUES ('Бюджетная'), ('Платная');
INSERT INTO sex(full, short) VALUES ('Мужской', 'М'), ('Женский', 'Ж');
INSERT INTO status(form) VALUES ('Аспирант'), ('Ассистент'), ('Ведущий научный сотрудник'), ('Главный научный сотрудник'), ('Докторант'), ('Доцент'), ('Младший научный сотрудник'), ('Научный сотрудник'), ('Преподаватель'), ('Профессор'), ('Старший преподаватель'), ('Стажер'), ('Студент');  
INSERT INTO speciality(full) VALUES ('Информатика'), ('Искусственный Интеллект'), ('Экономика'), ('ВМСИС');
INSERT INTO student(id_name1, id_name2, id_name3, id_personal_data)
WITH cte_name1 AS (SELECT id FROM name1 ORDER BY RAND() limit 100),
cte_name2 AS (SELECT id from name2 ORDER BY RAND() limit 100),
cte_name3 AS (SELECT id from name3 ORDER BY RAND() limit 100),
result as (SELECT n1.id as id_name1, 
			n2.id as id_name2, 
			n3.id as id_name3,
            row_number() over() as id_personal_data
            from cte_name1 n1
            cross join cte_name2 n2
            cross join cte_name3 n3
            )
select * from result limit 1000000;